#+STARTUP: inlineimages
#+OPTIONS: toc:nil

Alexa-enabled Somfy Shade Controller

** Decoding
#+NAME: instring
#+CAPTION: instring
#+BEGIN_EXAMPLE
0110011001101001011001010110101001100101010110011010101001010110100101011010100110101010101001010101101001011010
#+END_EXAMPLE

#+NAME: decoder
#+CAPTION: decoder
#+BEGIN_SRC ruby :var instring=instring :results output verbatim :exports both
bitstring = (instring.scan(/[01]/)).map(&:to_i)
bits = bitstring.each_slice(2).map do |pair|
#p pair
  case pair
  when [0, 1]
    1
  when [1, 0]
    0
  else
    'x'
  end
end
p bits

bytes = bits.each_slice(8).map do |word|
  # puts "0b#{word.join('')}"
  "0b#{word.join('')}".to_i(2)
end

print 'signal  '
print '0x', ((bytes.map { |b| format('%<b>02X', b: b) }).join ' '), "\n"

(1..6).reverse_each do |ii|
  bytes[ii] = bytes[ii] ^ bytes[ii - 1]
end

print 'decoded '
print '0x', ((bytes.map { |b| format('%<b>02X', b: b) }).join ' '), "\n"

printf "  header   = 0x%X\n", bytes[0] >> 4
printf "  key      = 0x%X\n", bytes[0] & 0xF
printf "  command  = 0x%X (%s)\n", bytes[1] >> 4, (['my', 'up', 'down', 'prog'].select.with_index { |c, i| ((bytes[1] >> 4) & (1 << i)).nonzero? }).join('+')

printf "  checksum = 0x%X\n", bytes[1] & 0xF
printf "  rolling  = 0x%04X\n", bytes[2] * 256 + bytes[3]
printf "  remote   = 0x%06X\n", (bytes[4] * 256 + bytes[5]) * 256 + bytes[6]

(1..6).each do |ii|
  bytes[ii] = bytes[ii] ^ bytes[ii - 1]
end

print 'recoded '
print '0x', ((bytes.map { |b| format('%<b>02X', b: b) }).join ' '), "\n"


#+END_SRC

#+RESULTS: decode
#+begin_example
[1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0]
signal  0xA9 B8 BD 0E 71 03 CC
decoded 0xA9 11 05 B3 7F 72 CF
  header   = 0xA
  key      = 0x9
  command  = 0x1 (my)
  checksum = 0x1
  rolling  = 0x05B3
  remote   = 0x7F72CF
recoded 0xA9 B8 BD 0E 71 03 CC
#+end_example

#+begin_example
[1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0]
signal  0xA9 B8 BD 0E 71 03 CC
decoded 0xA9 11 05 B3 7F 72 CF
  header   = 0xA
  key      = 0x9
  command  = 0x1 (my)
  checksum = 0x1
  rolling  = 0x05B3
  remote   = 0x7F72CF
recoded 0xA9 B8 BD 0E 71 03 CC
#+end_example

#+begin_example
[1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1]
signal  0xA5 2E 3C 91 E5 EF DD
decoded 0xA5 8B 12 AD 74 0A 32
  header   = 0xA
  key      = 0x5
  command  = 0x8 (prog)
  checksum = 0xB
  rolling  = 0x12AD
  remote   = 0x740A32
recoded 0xA5 2E 3C 91 E5 EF DD
#+end_example

#+begin_example
[1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, "x"]
signal  0xA5 2E 3C 91 E5 EF 6E
decoded 0xA5 8B 12 AD 74 0A 81
  header   = 0xA
  key      = 0x5
  command  = 0x8 (prog)
  checksum = 0xB
  rolling  = 0x12AD
  remote   = 0x740A81
recoded 0xA5 2E 3C 91 E5 EF 6E
#+end_example

#+begin_example
[1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1]
signal  0xA2 29 3B 91 E5 EF DD
decoded 0xA2 8B 12 AA 74 0A 32
  header   = 0xA
  key      = 0x2
  command  = 0x8 (prog)
  checksum = 0xB
  rolling  = 0x12AA
  remote   = 0x740A32
recoded 0xA2 29 3B 91 E5 EF DD
#+end_example

#+begin_example
[1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1]
signal  0xA1 2A 38 91 E5 EF DD
decoded 0xA1 8B 12 A9 74 0A 32
  header   = 0xA
  key      = 0x1
  command  = 0x8 (prog)
  checksum = 0xB
  rolling  = 0x12A9
  remote   = 0x740A32
recoded 0xA1 2A 38 91 E5 EF DD
#+end_example
